app/controllers/books_controller.rb

  def index
     @books = Book.all
---
SELECT "books".* FROM "books"

  def create
    @book = Book.new(book_params)

    if @book.save
      flash[:success] = "Book was successfully created."
      redirect_to book_path(@book.id)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body") VALUES (?, ?)  [["title", "かみかる"], ["body", "さいこう"]]
SELECT "books".* FROM "books"

  def show
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def edit
    @book = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]

  def update
    @book = Book.find(params[:id])
    @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
UPDATE "books" SET "title" = ?, "body" = ? WHERE "books"."id" = ?  [["title", "ああああああああああああああああああああああああ"], ["body", "ああああああああああああああああああああああああああ"], ["id", 12]]

  def destroy
    book = Book.find(params[:id])
    book.destroy
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 4]]